// RandomHomeWork.cpp : 이 파일에는 'main' 함수가 포함됩니다. 거기서 프로그램 실행이 시작되고 종료됩니다.
//

#include <iostream>

int main()
{
	{
		// char[7]

		// 스택영역에 있는 const char*       코드영역에 있는 char[7]
		// 형변환이 일어난 것이고
		// 그중에서 그걸 암시적 형변환이라고 한다.
		const char* Ptr = "김진아";

		__int64 Test0 = 10;
		// 그런데 내가 아무것도 안했는데도 그냥 당연히 그런것처럼 들어가면
		// 그걸 암시적 형변환이라고 합니다.
		int Test = Test0;

	}
	// char 배열형이다.
	// char[]
	// 배열은 중첩이 가능합니다.

	// char[][] 2차원
	char ArrName[30][20] = {
		"김진아",
		"김용회",
		"우창하",
		"조대규",
		"이현조",
		"김다현",
		"최환희",
		"김태욱",
		"박승호",
		"한승주",
		"윤종서",
		"김준겸",
		"홍영현",
		"배기원",
		"원다빈",
		"김지섭",
		"이정훈",
		"이준우",
		"이한성",
		"구성모",
		"김준영",
		"김태훈",
		"김성원",
		"변은수",
		"박정수",
		"유준상",
		"정경록",
		"전주호",
		"김유경",
		"한창희" };


	// ArrName 2차원
	// ArrName[0];
	// 2차원배열에서 1차원 배열로 변환

	srand(time(0));

	//for (int i = 0; i < 30; i++)
	//{
		int Index = rand() % 30;

		const char* Ptr = ArrName[Index];

		printf_s("%d %s 숙제검사 당첨\n", Index,  ArrName[Index]);
	//}
}
